;*************************************************************************
;   プログラム5.4   INT割り込みサブルーチン
;*************************************************************************
SP_A    EQU     9000H

        ORG     0038H       ; 割込み時のジャンプ先
        JP      ISUB

        ORG     8000H       ; メインルーチン
        IM      1           ; 割込みモード1の設定
        LD      SP, SP_A    ; SPの設定

        LD      B, 00H
        LD      A, 01H

        EI                  ; 割り込み許可
L1:     INC     A
        JP      L1
        HALT

ISUB:   LD      B, 55H      ; 割り込みサブルーチン
        EI                  ; 割り込み許可
        RETI                ; 割り込みからの復帰

        END
