;*************************************************************************
;   プログラム5.3   タイマプログラム
;*************************************************************************
SP_A    EQU     9000H
        ORG     8000H

        CALL    TIM2
        LD      SP, SP_A    ; SPの設定

        HALT

TIM2:   LD      C, 50D      ; 上位のタイマサブルーチン5.129ms
L2:     CALL    TIM1        ; 17ステート
        DEC     C           ; 4ステート
        JP      NZ, L2      ; 10ステート
        RET
TIM1:   LD      B, 67D      ; 下位のタイマサブルーチン100µs
L1:     DEC     B
        NOP
        JP      NZ, L1
        RET

        END
